{"/2025-2-Integralizei_UnB/docs/arquitetura/":{"data":{"":"O projeto Integralizei UnB foi criado para reduzir a incerteza e a ansiedade dos alunos durante o período de matrículas na UnB. Esta plataforma analisa o histórico acadêmico para fornecer clareza sobre o progresso do curso e a viabilidade de cursar disciplinas.\nEste documento apresenta a arquitetura do sistema, servindo como um guia central para a equipe de desenvolvimento.","2-princípios-da-arquitetura#2. Princípios da Arquitetura":"Nossa arquitetura foi projetada sobre três pilares essenciais para garantir a qualidade e a longevidade do projeto:\nManutenibilidade: Uma modularidade clara que permite ajustes e a evolução contínua do sistema sem grandes impactos. Testabilidade: Cada componente é isolado, permitindo a criação de testes unitários e de integração confiáveis. Produtividade: Um ecossistema tecnológico coeso (Next.js/TypeScript) que simplifica o desenvolvimento e a integração.","3-pilha-tecnológica#3. Pilha Tecnológica":"Front-end: Next.js (React + TypeScript) com Zustand para gerenciamento de estado global. Back-end: Next.js API Routes (Node.js + TypeScript). Banco de Dados: PostgreSQL. Serviços Externos: Google Gemini API (extração de dados de PDF) e API da Sua Grade UnB.","4-modelo-arquitetural-c4#4. Modelo Arquitetural (C4)":"","5-fluxo-de-dados#5. Fluxo de Dados":"Envio: O aluno envia o histórico acadêmico (PDF) através da interface (SPA). Orquestração: O Analysis Controller no back-end recebe o arquivo e gerencia o fluxo de processamento. Extração: O PDF Extractor, usando a API do Gemini, extrai os dados estruturados do histórico. Análise: O Ranking \u0026 Analysis Service recebe os dados, consulta o repositório histórico e realiza todos os cálculos. Resultado: A análise final (IRA, integralização, sugestões) é retornada para a SPA e exibida ao aluno.","6-decisões-arquiteturais-adrs#6. Decisões Arquiteturais (ADRs)":"Todas as decisões arquiteturais importantes são documentadas e mantidas na pasta /docs/adr/. Isso garante a rastreabilidade e o compartilhamento de conhecimento sobre as escolhas técnicas que moldaram o projeto.","7-conclusão#7. Conclusão":"A arquitetura do Integralizei UnB foi pensada para ser robusta e flexível, garantindo que o sistema não só atenda às necessidades atuais dos alunos, mas que também possa evoluir e incorporar novas funcionalidades no futuro.","funcionalidades-principais#Funcionalidades Principais":"✅ Cálculo Preciso: Fornece valores atualizados de integralização e IRA.\n✅ Verificação de Viabilidade: Confirma se o aluno pode cursar disciplinas específicas.\n✅ Sugestões Inteligentes: Recomenda matérias optativas com base nos critérios do aluno.","nível-1-diagrama-de-contexto#Nível 1: Diagrama de Contexto":"Mostra o sistema como uma “caixa-preta”, suas interações com o usuário (Aluno) e sistemas externos.","nível-2-diagrama-de-contêineres#Nível 2: Diagrama de Contêineres":"Apresenta os contêineres principais: SPA, Backend API e Banco de Dados.","nível-3-diagrama-de-componentes#Nível 3: Diagrama de Componentes":"Detalha os principais blocos internos do Backend API."},"title":"Documento de Arquitetura 🏗️"},"/2025-2-Integralizei_UnB/docs/arquitetura/armazenamento/":{"data":{"":"","3---armazenamento-de-dados#3 - Armazenamento de dados":"Os dados extraídos precisam ser organizados em um banco de dados para que possam ser consultados de forma eficiente. Um banco de dados relacional (SQL), ainda estamos vendo quais bancos usaremos."},"title":"Armazenamento de Dados"},"/2025-2-Integralizei_UnB/docs/arquitetura/coleta-de-dados/":{"data":{"":"","1---coleta-de-dados#1 - Coleta de dados":"O sucesso da nossa análise depende da qualidade e quantidade de dados. Nossa estratégia de coleta será dividida em duas fases:\nFase 1 (Pré-lançamento): Iniciaremos com uma base de dados menor, coletada através de envios voluntários. Isso nos permitirá treinar nossos modelos e garantir que a plataforma já seja útil desde o primeiro dia. Fase 2 (Site ativo): Com o site no ar, os próprios usuários poderão fazer o upload de seus históricos. Este processo será simples, rápido e seguro. O tratamento dos dados é de extrema importância, dados sensíveis como nome, CPF e matrícula são imediatamente descartados e nunca armazenados."},"title":"Coleta de Dados"},"/2025-2-Integralizei_UnB/docs/arquitetura/extracao-com-ia/":{"data":{"":"","2---extração-de-dados#2 - Extração de dados":"A fase de extração de informações é a mais crítica, já que os históricos em PDF possuem estruturas inconsistentes que dificultam a leitura por um software comum. Para resolver esse problema, utilizaremos um agente de Inteligência Artificial. Ele será capaz de analisar o PDF e facilmente nos devolver os dados que precisamos no formato necessário."},"title":"Extração de Dados"},"/2025-2-Integralizei_UnB/docs/arquitetura/logica-de-analise/":{"data":{"":"Para comparar os dados dos usuários utilizaremos o sistema oficial de “ranqueamento” da UNB:"},"title":"Lógica de Análise"},"/2025-2-Integralizei_UnB/docs/ata-de-reunioes/":{"data":{"":"Bem-vindo ao arquivo de Atas de Reunião do projeto Integralizei UNB.\nEsta seção é o coração da nossa organização, servindo como um registro transparente de todas as decisões, debates e tarefas definidas em nossos encontros.","estrutura-padrão-de-uma-ata#Estrutura Padrão de uma Ata":"Para manter a clareza e a consistência, todas as nossas atas seguem uma estrutura bem definida:\nDados da Reunião: Informações essenciais como data, horário e participantes presentes.\nPauta da Reunião: Os tópicos planejados para a discussão, garantindo que o encontro seja focado e produtivo.\nPontos Discutidos: Um resumo detalhado das conversas, argumentos e, mais importante, as decisões tomadas.\nTarefas Definidas: Uma lista clara de action items, cada uma com um responsável e um prazo para conclusão.\nPróximos Passos: Definições para a próxima reunião ou para a próxima etapa do projeto.","nossos-encontros#Nossos Encontros":"Nossas reuniões síncronas de equipe ocorrem duas vezes por semana:\nQuartas-feiras: 20:00 (Horário de Brasília) Domingos: 20:00 (Horário de Brasília) Plataforma: Todas as reuniões são realizadas no nosso servidor do Discord. 🎤\nNo indíce da página, você encontrará a lista de todas as atas de reunião, organizadas da mais recente para a mais antiga.\n{{ range .Pages }}\r{{ .Title }}\r{{ end }}"},"title":"Atas de Reunião 📑"},"/2025-2-Integralizei_UnB/docs/ata-de-reunioes/reuniao00/":{"data":{"-ata-da-reunião#📄 Ata da Reunião":"📄 Ata da ReuniãoData: 06/09/2025\nHorário: 10:30 - 11:30\nLocal: Online","-deliberações-e-discussões#💬 Deliberações e Discussões":"Realizado um benchmark de requisitos de projetos anteriores e/ou similares, identificando boas práticas e pontos de melhoria. Foram levantados e documentados os primeiros requisitos funcionais e não funcionais, servindo como base para o desenvolvimento inicial. Estabelecimento das próximas issues e milestones que orientarão o cronograma do projeto.","-encaminhamentos#✅ Encaminhamentos":"Consolidar os requisitos documentados na ferramenta de gestão do projeto Detalhar e atribuir responsáveis às issues definidas Atualizar o cronograma do projeto com as milestones acordadas","-encerramento#🔚 Encerramento":"Nada mais havendo a tratar, a reunião foi encerrada.","-participantes#👥 Participantes":"Ana Beatriz Souza Ana Caroline Dantas Enzo Menali Vettorato Gustavo Gomes Paulo Vitor Gomes","-pauta-da-reunião#📌 Pauta da Reunião":"Benchmark de requisitos de outros projetos Elaboração inicial dos requisitos funcionais e não funcionais do projeto Definição das próximas issues e milestones","-próxima-reunião#📅 Próxima Reunião":"Data prevista: 10/09/2025\nPauta inicial: acompanhamento da execução das issues e validação dos requisitos"},"title":"Reunião - 06/09/2025"},"/2025-2-Integralizei_UnB/docs/planejamento/":{"data":{"":"Esta seção centraliza todos os artefatos de planejamento e estratégia do projeto Integralizei UNB.\nEla serve como um ponto de partida para entender a visão do produto, a jornada do usuário, as decisões de arquitetura e as funcionalidades que serão desenvolvidas.\n🗺️\rUser Story Map\rNossa ferramenta visual para planejar a jornada do usuário e priorizar as funcionalidades.\r🏗️\rDocumento de Arquitetura\rA visão geral da nossa estrutura técnica, tecnologias e como os componentes se comunicam.\r📋\rProduct Backlog\rA lista completa e priorizada de todas as Histórias de Usuário.\r💡\rDecisões de Arquitetura (ADRs)\rO registro formal das decisões técnicas importantes que tomamos e suas justificativas."},"title":"Planejamento do Projeto 🎯"},"/2025-2-Integralizei_UnB/docs/prototipo/":{"data":{"":"","protótipo-de-baixa-fidelidade#Protótipo de Baixa Fidelidade":"Nossa equipe desenvolveu um protótipo interativo para demonstrar as funcionalidades e o fluxo de usuário.\nVocê pode acessá-lo no link abaixo:\nAcessar o Protótipo no Figma"},"title":"Protótipo do Projeto"},"/2025-2-Integralizei_UnB/docs/requisitos/":{"data":{"":"","funcionalidades-requisitos-funcionais#Funcionalidades (Requisitos Funcionais)":"Os requisitos funcionais descrevem o que o sistema deve fazer, ou seja, suas funcionalidades, serviços e comportamentos esperados.","lista#Lista":"Login com Conta no Google Recebimento do histórico Tutorial de como baixar seu histórico (abaixo do upload do histórico) Cálculo da integralização/IRA retroativas (semestres anteriores) Divisão das matérias por professor Sistema de rankeamento Calcular a média de integralização e IRA Pesquisa de matérias Recomendações: obrigatórias e optativas Cálculo de integralização futura Armazenamento de dados Reciclagem de histórico Favoritar matérias","não-funcionalidades#Não Funcionalidades":"Montar grade e fluxo ChatBot Salvar dados sensíveis Avaliação de professores","requisitos-não-funcionais#Requisitos Não Funcionais":"Os requisitos não funcionais descrevem como o sistema deve funcionar, incluindo restrições de desempenho, segurança, compatibilidade e usabilidade.\nNavegador: Google Chrome Segurança de dados e criptografia Garantia de acurácia acima de 95% na extração de dados dos históricos em PDF Interface intuitiva, com clareza e organização Leitura dos dados no intervalo:\n$A = {x \\in \\mathbb{Z} \\mid 2 \\leq x \\leq 15}, \\text{ em que } x \\text{ é dado em segundos}$"},"title":"Requisitos"},"/2025-2-Integralizei_UnB/docs/sprints/":{"data":{"":"Bem-vindo ao registro de Sprints do projeto Integralizei UNB. Esta seção é dedicada a documentar o ciclo de desenvolvimento iterativo e incremental do nosso projeto.","histórico-de-sprints#Histórico de Sprints":"Abaixo está a lista de todas as sprints executadas no projeto, com links para seus respectivos planejamentos e resultados.\nSprint 00: Iniciação e Pesquisa Sprint 01: Estruturação e Definição do Projeto Sprint 02: Aprofundamento Técnico e Benchmarking Sprint 03: Primeiras Implementações e Arquitetura Sprint 04: Refinamento para a Release 1","nossa-metodologia-de-sprints#Nossa Metodologia de Sprints":"Adotamos um framework ágil para garantir entregas contínuas e de alta qualidade.\nDuração: Cada sprint tem a duração de uma semana. Planejamento (Planning): No início de cada sprint, a equipe define as metas. Execução: Durante a semana, a equipe trabalha nas tarefas. Revisão (Review): Ao final, apresentamos o que foi concluído. Retrospectiva: A equipe discute o que pode ser melhorado."},"title":"Sprints do Projeto 🏃‍♂️"},"/2025-2-Integralizei_UnB/docs/sprints/sprint-00/":{"data":{"":"","backlog-da-sprint-00-o-plano#Backlog da Sprint 00 (O Plano)":"Meta da Sprint:\n“Nivelar o conhecimento da equipe nos conceitos e tecnologias fundamentais para o projeto, garantindo que todos tenham a base teórica necessária para as próximas fases de desenvolvimento.”\nItens do Backlog da Sprint (Tarefas de Estudo):\n[CONCLUÍDO] Task #1: Estudar os fundamentos e o fluxo de trabalho do GitHub para gerenciamento de versão. [CONCLUÍDO] Task #2: Estudar os conceitos básicos do framework Flutter para desenvolvimento de interface. [CONCLUÍDO] Task #3: Pesquisar e entender os princípios das Metodologias Ágeis, com foco em Scrum. [CONCLUÍDO] Task #4: Estudar as técnicas de levantamento e documentação de Requisitos de Software. [CONCLUÍDO] Task #5: Pesquisar os principais conceitos de Arquitetura de Software e padrões de mercado.","relatório-da-sprint-00-o-resultado#Relatório da Sprint 00 (O Resultado)":"1. Resumo da Sprint A Sprint 00 foi dedicada à capacitação e pesquisa da equipe. O objetivo era construir uma base de conhecimento sólida sobre os processos e tecnologias que serão utilizados ao longo do projeto.\n2. O que foi Concluído? Todos os itens planejados para a Sprint foram concluídos com sucesso. A equipe realizou estudos teóricos nas seguintes áreas:\nArquitetura de Software Requisitos de Software Metodologias Ágeis Flutter GitHub 3. O que Não foi Concluído? Nenhum item. Todas as metas de estudo da Sprint foram atingidas.\n4. Principais Dificuldades e Aprendizados\nDificuldades: A principal dificuldade encontrada pela equipe foi a familiarização com uma grande quantidade de termos técnicos novos e conceitos abstratos, especialmente em Arquitetura de Software e Metodologias Ágeis. Aprendizados: A equipe concluiu a Sprint com um entendimento fundamental e alinhado sobre como o projeto será gerenciado (GitHub, Metodologias Ágeis) e como será estruturado (Arquitetura, Requisitos). Essa base teórica foi crucial para preparar o time para as Sprints de desenvolvimento prático."},"title":"Sprint 00: Iniciação e Pesquisa"},"/2025-2-Integralizei_UnB/docs/sprints/sprint-01/":{"data":{"":"","backlog-da-sprint-01-o-plano#Backlog da Sprint 01 (O Plano)":"Meta da Sprint:\n“Dar os primeiros passos na estruturação do projeto, investigando tecnologias-chave, definindo os requisitos iniciais e estabelecendo a identidade visual e a documentação base.”\nItens do Backlog da Sprint (Tarefas Planejadas):\n[CONCLUÍDO] Task #6: Estruturar um banco de dados inicial utilizando JSON. [CONCLUÍDO] Task #7: Realizar estudos básicos sobre APIs para entender a viabilidade de integrações. [CONCLUÍDO] Task #8: Criar e configurar o README.md principal do projeto e ajustar o tema da documentação. [CONCLUÍDO] Task #9: Realizar o levantamento de requisitos funcionais e não funcionais para o projeto. [CONCLUÍDO] Task #10: Desenvolver os protótipos de tela de baixa/média fidelidade no Figma.","relatório-da-sprint-01-o-resultado#Relatório da Sprint 01 (O Resultado)":"1. Resumo da Sprint A Sprint 01 marcou a transição da fase puramente teórica para a aplicação prática e o planejamento do projeto. A equipe focou em levantar os requisitos, explorar a estrutura de dados com JSON, estudar APIs e iniciar a prototipação visual no Figma. O evento mais significativo da sprint foi a mudança estratégica no escopo do projeto.\n2. O que foi Concluído? Todos os itens planejados para a Sprint foram 100% concluídos. As entregas foram:\nLevantamento de Requisitos documentado. Protótipos de tela no Figma. Estrutura inicial para o banco de dados em JSON. Estudos sobre API. Documentação inicial (README.md) configurada. 3. O que Não foi Concluído? Nenhum item. Todas as metas da Sprint foram atingidas.\n4. Principais Dificuldades e Aprendizados\nDificuldades: A equipe continuou a enfrentar desafios com a assimilação de novos termos e conceitos técnicos, um processo natural na fase inicial de um projeto. Aprendizados: O principal aprendizado da Sprint foi a validação da viabilidade do projeto. A equipe descobriu que a ideia original não era factível devido à falta de acesso aos dados necessários. Isso levou a uma decisão ágil e crucial de pivotar para o novo tema “Integralizei UNB”. Este aprendizado evitou que a equipe desperdiçesse tempo em um caminho inviável e demonstrou grande capacidade de adaptação."},"title":"Sprint 01: Estruturação e Definição do Projeto"},"/2025-2-Integralizei_UnB/docs/sprints/sprint-02/":{"data":{"":"","backlog-da-sprint-02-o-plano#Backlog da Sprint 02 (O Plano)":"Meta da Sprint:\n“Aprofundar o conhecimento da equipe em áreas técnicas cruciais para a implementação do projeto, investigando soluções para IA, automação, autenticação, e analisando produtos através de benchmarking.”\nItens do Backlog da Sprint (Tarefas de Estudo):\n[CONCLUÍDO] Task #11: Estudar o funcionamento e a configuração do GitHub Pages para a documentação do projeto. [CONCLUÍDO] Task #12: Pesquisar sobre Agentes de IA e tecnologias para a extração de dados de PDFs. [CONCLUÍDO] Task #13: Estudar a criação de um pipeline de automação (CI/CD) utilizando GitHub Actions. [CONCLUÍDO] Task #14: Pesquisar sobre métodos e tecnologias para a autenticação de usuários. [CONCLUÍDO] Task #15: Realizar um benchmark de projetos ou ferramentas similares para extrair insights e boas práticas.","relatório-da-sprint-02-o-resultado#Relatório da Sprint 02 (O Resultado)":"1. Resumo da Sprint A Sprint 02 continuou o foco em pesquisa, mas com um nível de profundidade maior, visando responder a questões específicas de implementação. O objetivo foi capacitar a equipe para tomar decisões arquiteturais importantes nas sprints de desenvolvimento.\n2. O que foi Concluído? Todos os 5 estudos planejados para a Sprint foram concluídos com sucesso, e o conhecimento foi compartilhado entre a equipe. As áreas pesquisadas foram:\nAgentes de IA para extração de dados. GitHub Pages. Benchmarking de mercado. Autenticação de usuários. Pipeline com GitHub Actions. 3. O que Não foi Concluído? Nenhum item. Todas as metas de estudo da Sprint foram atingidas.\n4. Principais Dificuldades e Aprendizados\nDificuldades: O aprofundamento nos temas trouxe à tona a complexidade das escolhas tecnológicas. A equipe debateu sobre as vantagens e desvantagens de diferentes abordagens, o que é uma dificuldade natural e produtiva nesta fase. Aprendizados: O principal resultado desta Sprint foi a clareza sobre o caminho tecnológico. A pesquisa ajudou a equipe a formular perguntas mais concretas, como a escolha da linguagem de programação principal e quais frameworks seriam mais adequados. O benchmark, em particular, forneceu insights valiosos que influenciarão o design e as funcionalidades do “Integralizei UNB”."},"title":"Sprint 02: Aprofundamento Técnico e Benchmarking"},"/2025-2-Integralizei_UnB/docs/sprints/sprint-03/":{"data":{"":"","backlog-da-sprint-03-o-plano#Backlog da Sprint 03 (O Plano)":"Meta da Sprint:\n“Finalizar os preparativos técnicos e de design para a primeira release do projeto, iniciando o desenvolvimento de componentes-chave e validando as escolhas de arquitetura.”\nItens do Backlog da Sprint (Tarefas Planejadas):\n[CONCLUÍDO] Task #17: Reorganizar e refinar os protótipos de alta fidelidade no Figma. [CONCLUÍDO] Task #18: Desenvolver um formulário funcional para o upload de histórico acadêmico. [CONCLUÍDO] Task #19: Realizar estudo técnico sobre a viabilidade de integração com a API do Sigaa. [CONCLUÍDO] Task #20: Implementar o protótipo inicial do site com base nos designs do Figma. [CONCLUÍDO] Task #21: Configurar o deploy contínuo do site de documentação com Hugo e GitHub Pages/Actions.","relatório-da-sprint-03-o-resultado#Relatório da Sprint 03 (O Resultado)":"1. Resumo da Sprint A Sprint 03 marcou o início efetivo do desenvolvimento e da validação técnica do projeto. A equipe deixou a fase de pesquisa teórica e começou a aplicar o conhecimento adquirido, trabalhando na implementação de protótipos funcionais, na configuração da infraestrutura de documentação e na tomada de decisões arquiteturais concretas.\n2. O que foi Concluído? Todas as tarefas planejadas para a sprint foram concluídas com sucesso. As principais entregas foram:\nO site de documentação do projeto foi configurado e publicado com sucesso via GitHub Pages. Um protótipo navegável do site foi desenvolvido. O formulário para upload de histórico foi criado, representando o primeiro componente interativo do sistema. Os designs no Figma foram ajustados e finalizados para guiar o desenvolvimento. O estudo sobre a API do Sigaa forneceu clareza sobre os próximos passos de integração de dados. 3. O que Não foi Concluído? Nenhum item. Todas as metas da Sprint foram atingidas.\n4. Principais Dificuldades e Aprendizados\nDificuldades: O contato direto com as novas tecnologias (Hugo, GitHub Actions, desenvolvimento de formulários web) apresentou a curva de aprendizado esperada. A aplicação prática dos conceitos teóricos se mostrou um desafio produtivo para a equipe, exigindo pesquisa e colaboração para solucionar problemas. Aprendizados: O maior aprendizado foi a transição bem-sucedida da teoria para a prática. A equipe começou a testar suas hipóteses e a fazer escolhas de arquitetura reais. A configuração do pipeline do site de documentação, por exemplo, deu à equipe uma vitória importante e um aprofundamento prático em CI/CD."},"title":"Sprint 03: Primeiras Implementações e Arquitetura"},"/2025-2-Integralizei_UnB/docs/sprints/sprint-04/":{"data":{"":"","backlog-da-sprint-04-o-plano#Backlog da Sprint 04 (O Plano)":"Meta da Sprint:\n“Refinar e organizar os artefatos do projeto, validando a aplicação das metodologias ágeis e identificando possíveis lacunas para garantir que todos os critérios para a primeira release fossem atendidos.”\nItens do Backlog da Sprint (Tarefas Planejadas):\n[CONCLUÍDO] Task #23: Finalizar a documentação de Arquitetura do sistema. [CONCLUÍDO] Task #24: Realizar estudos e testes iniciais com Next.js como uma possível tecnologia para o frontend. [CONCLUÍDO] Task #26: Estruturar e documentar o Product Backlog completo do projeto. [CONCLUÍDO] Task #27: Criar o protótipo de baixa e alta fidelidade para validar os fluxos de usuário.","relatório-da-sprint-04-o-resultado#Relatório da Sprint 04 (O Resultado)":"1. Resumo da Sprint A Sprint 04 serviu como uma “sprint de fechamento” da fase de planejamento. O foco foi consolidar toda a documentação gerada, refinar o Product Backlog, criar e refinar os protótipos de baixa e alta fidelidade para validação de conceito e realizar uma autoavaliação sobre a aplicação das metodologias ágeis no projeto até o momento.\n2. O que foi Concluído? Apesar da pressão do prazo para a release, todos os itens planejados foram concluídos com sucesso:\nO Product Backlog foi formalmente documentado. A Documentação de Arquitetura foi finalizada. Estudos importantes sobre a tecnologia do frontend (Next.js) foram realizados. O protótipo de baixa fidelidade foi entregue, ajudando a clarificar os fluxos da aplicação. 3. O que Não foi Concluído? Nenhum item. Todas as metas da Sprint foram atingidas.\n4. Principais Dificuldades e Aprendizados\nDificuldades: A principal dificuldade foi o gerenciamento do tempo. A proximidade da data da primeira release, somada a outras demandas, criou um ambiente de pressão para a equipe. Aprendizados: O maior aprendizado desta sprint foi o valor da revisão e da reflexão. Ao parar para analisar o trabalho feito, a equipe conseguiu identificar lacunas e garantir a coerência entre todos os artefatos do projeto (requisitos, arquitetura, backlog). A autoavaliação sobre o uso das metodologias ágeis também foi crucial para fortalecer o processo de trabalho da equipe para as futuras sprints de desenvolvimento."},"title":"Sprint 04: Refinamento para a Release 1"},"/2025-2-Integralizei_UnB/docs/story-map/":{"data":{"":"O User Story Map (Mapa de Histórias de Usuário) é a nossa principal ferramenta de planejamento. Ele organiza a jornada do estudante em grandes atividades e detalha as funcionalidades (histórias) necessárias para construir o produto, priorizando o que entrega mais valor primeiro.\nO mapa é dividido horizontalmente em Releases (Entregas), garantindo que a primeira versão do produto (MVP) já seja funcional e resolva o problema principal do usuário.","mvp---produto-mínimo-viável#(MVP - Produto Mínimo Viável)":"Esta é a primeira versão do produto, focada na jornada essencial: o estudante pode se cadastrar, analisar seu histórico e planejar o próximo semestre.\nEspinha Dorsal (Atividades do Usuário):\nAcessar/Configurar Perfil → Analisar Situação Atual → Planejar Próximo Semestre\n### 🧗 Épico 1\r**Criar Conta e Fazer Login**\r- **US01:** Criar conta de novo usuário.\r- **US02:** Fazer login de usuário existente.\r### 📊 Épico 2\r**Enviar Histórico e Ver Análise**\r- **US03:** Encontrar botão para upload do histórico.\r- **US04:** Ver progresso da análise.\r- **US05:** Visualizar dashboard com dados extraídos.\r- **US06:** Ver métricas principais (IRA, etc.) em destaque.\r- **US07:** Listar matérias obrigatórias pendentes.\r- **US09:** Ver predição da chance na vaga.\r### 💡 Épico 3\r**Simular Grade Horária**\r- **US11:** Buscar matérias para a simulação.\r- **US12:** Adicionar e remover matérias.\r- **US13:** Ver resultado do cálculo (créditos, integralização).\r- **US14:** Salvar a simulação para consulta futura.","versão-futura#(Versão Futura)":"Após o lançamento do MVP, esta entrega adiciona funcionalidades poderosas de pesquisa e descoberta, enriquecendo a experiência do usuário.\nEspinha Dorsal (Atividades do Usuário):\nExplorar Disciplinas da Universidade\n### 🔍 Épico 4\r**Pesquisar Turmas Específicas**\r- **US15:** Buscar matéria por nome ou código.\r- **US16:** Ver estatísticas da turma (taxa de aprovação, IRA médio).\r- **US17:** Ver \"ranking\" anônimo de alunos que conseguiram a vaga.\r- **US18:** Favoritar turmas de interesse."},"title":"User Story Map 🗺️"}}