{"/2025-2-Integralizei_UnB/docs/arquitetura/":{"data":{"":"Bem-vindo à documentação da arquitetura do projeto Integralizei UNB.\nEsta seção detalha a estrutura técnica, as tecnologias escolhidas e as decisões de design que formam a espinha dorsal da nossa aplicação. O objetivo é fornecer uma visão clara de como os componentes do sistema se conectam e operam.","diagrama-da-arquitetura#Diagrama da Arquitetura":"A imagem abaixo ilustra o fluxo de dados e a interação entre os principais componentes do nosso sistema.","pilares-da-nossa-arquitetura#Pilares da Nossa Arquitetura":"A construção do nosso sistema foi guiada por quatro princípios fundamentais para garantir um produto robusto, seguro e eficiente.\nModularidade: Cada componente do backend (coleta, extração, armazenamento e análise) foi projetado para operar de forma independente. Isso facilita a manutenção, o teste e futuras atualizações sem impactar o resto do sistema.\nEscalabilidade: A arquitetura foi pensada para suportar um número crescente de usuários e um volume cada vez maior de dados de históricos, garantindo que a performance não seja degradada com o tempo.\nSegurança e Privacidade: A proteção dos dados do usuário é nossa maior prioridade. Implementamos uma política de descarte imediato de dados sensíveis e utilizamos as melhores práticas para o armazenamento seguro das informações relevantes.\nAcurácia: A escolha de usar um agente de IA para a extração de dados foi uma decisão estratégica para garantir a máxima precisão na leitura dos diferentes formatos de históricos, que é o núcleo da nossa funcionalidade."},"title":"Arquitetura do Sistema 🏗️"},"/2025-2-Integralizei_UnB/docs/ata-de-reunioes/":{"data":{"":"Bem-vindo ao arquivo de Atas de Reunião do projeto Integralizei UNB.\nEsta seção é o coração da nossa organização, servindo como um registro transparente de todas as decisões, debates e tarefas definidas em nossos encontros.","estrutura-padrão-de-uma-ata#Estrutura Padrão de uma Ata":"Para manter a clareza e a consistência, todas as nossas atas seguem uma estrutura bem definida:\nDados da Reunião: Informações essenciais como data, horário e participantes presentes.\nPauta da Reunião: Os tópicos planejados para a discussão, garantindo que o encontro seja focado e produtivo.\nPontos Discutidos: Um resumo detalhado das conversas, argumentos e, mais importante, as decisões tomadas.\nTarefas Definidas: Uma lista clara de action items, cada uma com um responsável e um prazo para conclusão.\nPróximos Passos: Definições para a próxima reunião ou para a próxima etapa do projeto.","nossos-encontros#Nossos Encontros":"Nossas reuniões síncronas de equipe ocorrem duas vezes por semana:\nQuartas-feiras: 20:00 (Horário de Brasília) Domingos: 20:00 (Horário de Brasília) Plataforma: Todas as reuniões são realizadas no nosso servidor do Discord. 🎤\nNo indíce da página, você encontrará a lista de todas as atas de reunião, organizadas da mais recente para a mais antiga."},"title":"Atas de Reunião 📑"},"/2025-2-Integralizei_UnB/docs/ata-de-reunioes/reuniao00/":{"data":{"-ata-da-reunião#📄 Ata da Reunião":"📄 Ata da ReuniãoData: 06/09/2025\nHorário: 10:30 - 11:30\nLocal: Online","-deliberações-e-discussões#💬 Deliberações e Discussões":"Realizado um benchmark de requisitos de projetos anteriores e/ou similares, identificando boas práticas e pontos de melhoria. Foram levantados e documentados os primeiros requisitos funcionais e não funcionais, servindo como base para o desenvolvimento inicial. Estabelecimento das próximas issues e milestones que orientarão o cronograma do projeto.","-encaminhamentos#✅ Encaminhamentos":"Consolidar os requisitos documentados na ferramenta de gestão do projeto Detalhar e atribuir responsáveis às issues definidas Atualizar o cronograma do projeto com as milestones acordadas","-encerramento#🔚 Encerramento":"Nada mais havendo a tratar, a reunião foi encerrada.","-participantes#👥 Participantes":"Ana Beatriz Souza Ana Caroline Dantas Enzo Menali Vettorato Gustavo Gomes Paulo Vitor Gomes","-pauta-da-reunião#📌 Pauta da Reunião":"Benchmark de requisitos de outros projetos Elaboração inicial dos requisitos funcionais e não funcionais do projeto Definição das próximas issues e milestones","-próxima-reunião#📅 Próxima Reunião":"Data prevista: 10/09/2025\nPauta inicial: acompanhamento da execução das issues e validação dos requisitos"},"title":"Reunião - 06/09/2025"},"/2025-2-Integralizei_UnB/docs/prototipo/":{"data":{"":"","protótipo-de-baixa-fidelidade#Protótipo de Baixa Fidelidade":"Nossa equipe desenvolveu um protótipo interativo para demonstrar as funcionalidades e o fluxo de usuário.\nVocê pode acessá-lo no link abaixo:\nAcessar o Protótipo no Figma"},"title":"Protótipo do Projeto"},"/2025-2-Integralizei_UnB/docs/requisitos/":{"data":{"":"","funcionalidades-requisitos-funcionais#Funcionalidades (Requisitos Funcionais)":"Os requisitos funcionais descrevem o que o sistema deve fazer, ou seja, suas funcionalidades, serviços e comportamentos esperados.","lista#Lista":"Login com Conta no Google Recebimento do histórico Tutorial de como baixar seu histórico (abaixo do upload do histórico) Cálculo da integralização/IRA retroativas (semestres anteriores) Divisão das matérias por professor Sistema de rankeamento Calcular a média de integralização e IRA Pesquisa de matérias Recomendações: obrigatórias e optativas Cálculo de integralização futura Armazenamento de dados Reciclagem de histórico Favoritar matérias","não-funcionalidades#Não Funcionalidades":"Montar grade e fluxo ChatBot Salvar dados sensíveis Avaliação de professores","requisitos-não-funcionais#Requisitos Não Funcionais":"Os requisitos não funcionais descrevem como o sistema deve funcionar, incluindo restrições de desempenho, segurança, compatibilidade e usabilidade.\nNavegador: Google Chrome Segurança de dados e criptografia Garantia de acurácia acima de 95% na extração de dados dos históricos em PDF Interface intuitiva, com clareza e organização Leitura dos dados no intervalo:\n$A = {x \\in \\mathbb{Z} \\mid 2 \\leq x \\leq 15}, \\text{ em que } x \\text{ é dado em segundos}$"},"title":"Requisitos"},"/2025-2-Integralizei_UnB/docs/sprints/":{"data":{"":"Bem-vindo ao registro de Sprints do projeto Integralizei UNB.\nEsta seção é dedicada a documentar o ciclo de desenvolvimento iterativo e incremental do nosso projeto. Cada sprint representa um período focado de trabalho com o objetivo de entregar um incremento de valor ao produto final.","artigos-da-seção#Artigos da Seção":"","histórico-de-sprints#Histórico de Sprints":"Abaixo está a lista de todas as sprints executadas no projeto, com links para seus respectivos planejamentos e resultados.","nossa-metodologia-de-sprints#Nossa Metodologia de Sprints":"Adotamos um framework ágil para garantir entregas contínuas e de alta qualidade. Nossas sprints são estruturadas da seguinte forma:\nDuração: Cada sprint tem a duração de uma semana, começando na segunda-feira e terminando no domingo. Planejamento (Planning): No início de cada sprint, a equipe se reúne para definir as metas e selecionar as tarefas do backlog que serão desenvolvidas. Execução: Durante a semana, a equipe trabalha nas tarefas definidas. Revisão (Review): Ao final da sprint, apresentamos o que foi concluído para validar o incremento de software. Retrospectiva: Após a revisão, a equipe discute o que correu bem, o que pode ser melhorado e define ações para o próximo ciclo."},"title":"Sprints do Projeto 🏃‍♂️"}}